package Task7;

public class Task7hard {
}

/*
Для вас задачка чуть сложнее. Условия те же, но у человека в начале программы спрашивают, за кого он хочет играть. Можно ввести X, чтобы играть за крестики или ввести O - за нолики. Первыми ходят крестики, так что если человек выбрал нолики, первым ходит компьютер.

Помимо этого, компьютер ходит на свободное поле случайным образом.

Плюс, программа сама автоматически должна определить, закончилась ли игра или нет. Игра заканчивается, когда на поле кончаются свободные клеточки. Или когда кто-то победил - то есть когда нолики стоят три по горизонтали, либо три по диагонали, либо три по вертикали. Компьютер должен написать в конце причину, по которой игра закончилась:

"Человек победил", "Компьютер победил", "Ничья"
 */